IRP/src/Documents/PurchaseInvoice/PurchaseInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PurchaseInvoice</name>
  <registerRecords>AccumulationRegister.OrderBalance</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBalance</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitIncoming</registerRecords>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <registerRecords>AccumulationRegister.PurchaseTurnovers</registerRecords>
  <registerRecords>AccumulationRegister.PartnerApTransactions</registerRecords>
  <registerRecords>AccumulationRegister.AdvanceToSuppliers</registerRecords>
  <registerRecords>AccumulationRegister.ReceiptOrders</registerRecords>
  <registerRecords>AccumulationRegister.ExpensesTurnovers</registerRecords>
  <registerRecords>AccumulationRegister.GoodsReceiptSchedule</registerRecords>
  <registerRecords>AccumulationRegister.OrderProcurement</registerRecords>
  <registerRecords>AccumulationRegister.ReconciliationStatement</registerRecords>
  <registerRecords>AccumulationRegister.TaxesTurnovers</registerRecords>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludeTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>IsOpeningEntry</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>PurchaseOrder</name>
      <type>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.typePrice</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceType</name>
      <type>
        <types>CatalogRef.PriceTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>TotalAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>NetAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>OffersAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>GoodsReceipt</name>
      <type>
        <types>DocumentRef.GoodsReceipt</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>AdditionalAnalytic</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SpecialOffers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Offer</name>
      <type>
        <types>CatalogRef.SpecialOffers</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.typePercent</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TaxList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.Taxes</types>
      </type>
    </attributes>
    <attributes>
      <name>Analytics</name>
      <type>
        <types>CatalogRef.TaxAnalytics</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxRate</name>
      <type>
        <types>CatalogRef.TaxRates</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeToTotalAmount</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/PurchaseInvoice/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	ThisObject.DocumentAmount = ThisObject.ItemList.Total("TotalAmount");
EndProcedure

Procedure Posting(Cancel, PostingMode)
	
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
	
EndProcedure

Procedure UndoPosting(Cancel)
	
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
	
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("Structure") Then
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "PurchaseOrder" Then
			Filling_BasedOnPurchaseOrder(FillingData);
		EndIf;
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "SalesOrder" Then
			
			Filling_BasedOnPurchaseOrder(FillingData);
			
		EndIf;
	EndIf;
EndProcedure

Procedure Filling_BasedOnPurchaseOrder(FillingData)
	FillPropertyValues(ThisObject, FillingData,
		"Company,Partner,LegalName,Agreement,Currency,PriceIncludeTax");
	
	For Each Row In FillingData.ItemList Do
		NewRow = ThisObject.ItemList.Add();
		FillPropertyValues(NewRow, Row);
	EndDo;
	For Each Row In FillingData.TaxList Do
		NewRow = ThisObject.TaxList.Add();
		FillPropertyValues(NewRow, Row);
	EndDo;
	For Each Row In FillingData.SpecialOffers Do
		NewRow = ThisObject.SpecialOffers.Add();
		FillPropertyValues(NewRow, Row);
	EndDo;
EndProcedure

Procedure OnCopy(CopiedObject)
	
	LinkedTables = New Array();
	LinkedTables.Add(SpecialOffers);
	LinkedTables.Add(TaxList);
	LinkedTables.Add(Currencies);
	DocumentsServer.SetNewTabelUUID(ItemList, LinkedTables);
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If DocumentsServer.CheckItemListStores(ThisObject) Then
		Cancel = True;	
	EndIf;
EndProcedure
